# StairsSupporttypeStructuralDepthOnLanding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupporttypeStructuralDepthOnLanding Property
ParameterTypeId Class See Also
---
"Structural Depth On Landing": Structural Depth
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupporttypeStructuralDepthOnLanding { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupporttypeStructuralDepthOnLanding As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupporttypeStructuralDepthOnLanding {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace